<?php
include('config.php');

$ชื่อผู้ส่งจดหมาย = $_GET['a1'];
$นามสกุลส่งจดหมาย = $_GET['b1'];
$ชื่อผู้รับจดหมาย = $_GET['a2'];
$นามสกุลผู้รับจดหมาย = $_GET['b2'];
$บ้านเลขที่ = $_GET['c1'];
$หมู่ = $_GET['d1'];
$ซอย = $_GET['e1'];
$ตำบล = $_GET['f1'];
$อำเภอ = $_GET['g1'];
$จังหวัด = $_GET['h1'];
$รหัสไปรษณีย์ = $_GET['i1'];
$วันที่ส่ง = $_GET['j1'];
$วันที่รับ = $_GET['j2'];

//ไฟล์นี้สำหรับเพิ่มข้อมูล
$sql  = "INSERT INTO `show`(`ชื่อผู้รับจดหมาย`, `นามสกุลผู้รับจดหมาย`, `ชื่อผู้ส่งจดหมาย`, `นามสกุลผู้ส่งจดหมาย`, `บ้านเลขที่`, `หมู่บ้าน`, `ซอย`, `ตำบล`, `อำเภอ`, `จังหวัด`, `รหัสไปรษณีย์`, `วันที่ส่ง`, `วันที่รับ`) 
VALUES ('$ชื่อผู้ส่งจดหมาย','$นามสกุลส่งจดหมาย','$ชื่อผู้รับจดหมาย','$นามสกุลผู้รับจดหมาย ','$บ้านเลขที่','$หมู่','$ซอย','$ตำบล','$อำเภอ','$จังหวัด','$รหัสไปรษณีย์ ','$วันที่ส่ง','$วันที่รับ')";
$query = $dbcon->prepare($sql);

$result = $query->execute();
if ($result) {
    echo "<script>
              alert('เพิ่มข้อมูลเรียบร้อย');
              window.location='select.php';
          </script>";
} else {
    echo "<script>alert('มีบางอย่างผิดพลาด');</script>";
}

?>